# ReadOnlyParameters Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..ReadOnlyParameters Property
Rebar Class See Also
---
When set to true, Rebar will report all its parameters as read only. For example, the method Parameter::IsReadOnly() for all Rebar Parameters will return true. When set to false, the return value of Parameter::IsReadOnly() will not be affected.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool ReadOnlyParameters { get; set; }
```

Visual Basic
---
```text
Public Property ReadOnlyParameters As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ReadOnlyParameters {
	bool get ();
	void set (bool value);
}
```

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace